player ={
    "xp":100,
    "def":0,
    "atk":100,
    "sparki":0,
    "lvl":1,
    "lmt":0,
    "lmt+":0,
    "lmt++":0,
    "time":0,
    "Сила":10,
    "Ум":10,
    "Ловкость":10,
    "Оборона":10,
    "izmer":0,
    "spa":0,
    "son":0
}


magazine ={
    "+atk":{
            "1 - Старый меч":15,
            "2 - Медный меч":50,
            "3 - Стальной меч":100,
            "4 - Алмазный меч":200,
            "5 - Клинки Мрклштлакклара":5000,
            "6 - Копьё Отца":50000
    },

    "+def":{
            "1 - Броня из подушек":3,
            "2 - Броня медная":10,
            "3 - Броня железная":45,
            "4 - Броня алмазная":130,
            "5 - Броня незеритовая":700,
            "6 - Одежда JDH":6900,
            "7 - Очки Джонолошки":350000
    },

    "+xp":{
            "1 - Улучшение фонтана жизни":150,
            "2 - +Улучшение фонтана жизни":350,
            "3 - ++Улучшение фонтана жизни":1000,
            "4 - +++Улучшение жизни":1500,
            "5 - ++++Улучшение фонтана жизни":13000,
            "6 - +++++Улучшение фонтана жизни":800000
    },

    "potion":{
            "Зелье силы":{
                "Cost":80000,
                "+lv":1.5
            },

            "Зелье твёрдой кожи":{
                "Cost":60000,
                "+lv":1.7
            },

            "Зелье быстрого кровотока":{
                "Cost":100000,
                "+lv":2
            }
    },

    "Механизмы":{
        "2 - Перемотка времени":{
            "Описание":"При покупке ты сможешь убивать боссов уже бесконечно раз",
            "Cost":25000,
        }
    }
}



enemy ={
    "Заражённая мышь": {
        "xp": 10,
        "def":0,
        "atk":4
     },

    "Червь переросток": {
        "xp":110,
        "def":5,
        "atk":10
    },
    "Заражённый":{
        "xp":250,
        "def":20,
        "atk":40
    },
    "Заражённый дракон":{
        "xp":700,
        "def":100,
        "atk":70
    },
    "Шандр’гралла’дтрин":{
        "xp":1000,
        "def":500,
        "atk":100
    },
    "Лукий":{
        "xp":10000,
        "def":5800,
        "atk":3000
    },
    "Отец":{
        "xp":500000,
        "def":200000,
        "atk":10000
    }
}


inventory = {
    "Палка":{
        "atk":1
    },

    "Фонтан жизни":{
        "xp":100
    }
}







sonnoe = {
    "Невер":{
        "Друг":0
    },
    "Марк":{
        "Друг":0
    },
    "Гимлин":{
        "Друг":0
    },
    "Беренгарий":{
        "Друг":30
    },
    "Альфред":{
        "Друг":10
    }
}





limit = {
        "never":0,
        "mark":0,
        "alfred":0,
        "berengarii":0
}

village = []
